package java_study_0121;

public class study4_0121 {

	public static void main(String[] args) {
		// 연산자 정리
		
		// 연산자
		/*
		 * 1. 사칙 연산자 -> +(더하기), -(빼기), *(곱하기), /(나누기: 몫이 나옴), %(나누기 : 나머지가 나옴)
		 * 2. 대입 연산자 -> =(저장)
		 * 3. 증감 연산자 -> ++(1씩 증가), --(1씩 감소)
		 * 4. 복합 대입 연산자 -> +=(더하기해서 왼쪽저장), -=(빼기해서 왼쪽저장), *=(곱해서 왼쪽저장), /=(나눠서 왼쪽저장), %=(나눠서 왼쪽저장)
		 * 5. 비교 연산자 -> >(크다), <(작다), >=(이상), <=(이하), ==(같다), !=(같지않다)
		 * 6. 논리 연산자 -> &&(and 라는 뜻), ||(or 이라는 뜻 : shift + \), !(not 이라는 뜻)
		 * 7. 조건(삼항) 연산자 -> (조건식:비교 연산자와 논리 연산자로 구성된 식)? 참일경우 실행할 내용 : 거짓일 경우 실행할 내용
		 * 
		 * 8. 비트 연산자 : 2진수 연산(진법 변환 필요)
		 * 	8-1. 비트 논리 연산자 -> &(and), |(or), ~(not), ^(xor)
		 * 	8-2. 비트 쉬프트 연산자 -> <<(왼쪽 쉬프트) , >>(오른쪽 쉬프트)
		 */
		
		
		
		
	}

}
